Revit 2026 API

# AdvancedWoodWoodGrooveRoughness Property

---

The property labeled "Roughness for surface groove area" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodGrooveRoughness { get; }
```
```vb
Public Shared ReadOnly Property WoodGrooveRoughness As String
	Get
```
```cpp
public:
static property String^ WoodGrooveRoughness {
	String^ get ();
}
```
```fsharp
static member WoodGrooveRoughness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace